In [6]:
import pandas as pd
import numpy as np

In [2]:
ser = pd.Series(range(5), index=list("abcde"))
ser

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [3]:
ser.loc[["a", "c", "e"]]

a    0
c    2
e    4
dtype: int64

In [7]:
df = pd.DataFrame(np.arange(25).reshape(5, 5), index=list("abcde"), columns=list("abcde"))
df

    a   b   c   d   e
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [8]:
df.loc[["a", "c", "e"], ["b", "d"]]

    b   d
a   1   3
c  11  13
e  21  23

In [9]:
dates = pd.date_range('1/1/2000', periods=8)

df = pd.DataFrame(np.random.randn(8, 4),

                  index=dates, columns=['A', 'B', 'C', 'D'])



df

                   A         B         C         D
2000-01-01 -0.018492  0.704924  0.761786  1.084438
2000-01-02  0.497136 -0.114484  1.184610  0.756158
2000-01-03 -0.116372 -0.708337  0.949433  0.054825
2000-01-04 -0.064605 -0.689296  0.310550  0.471620
2000-01-05  0.207694 -0.818026  0.359911  0.346075
2000-01-06 -0.337750  0.812771  0.645985  0.119537
2000-01-07 -0.844191 -0.117398 -0.905368 -0.365953
2000-01-08 -0.121758  0.439313 -0.726344  0.969090

In [11]:
s = df['A']
s

2000-01-01   -0.018492
2000-01-02    0.497136
2000-01-03   -0.116372
2000-01-04   -0.064605
2000-01-05    0.207694
2000-01-06   -0.337750
2000-01-07   -0.844191
2000-01-08   -0.121758
Freq: D, Name: A, dtype: float64

In [12]:
s[dates[5]]

-0.3377502112409749

In [13]:
df[['B', 'A']] = df[['A', 'B']]

In [14]:
df

                   A         B         C         D
2000-01-01  0.704924 -0.018492  0.761786  1.084438
2000-01-02 -0.114484  0.497136  1.184610  0.756158
2000-01-03 -0.708337 -0.116372  0.949433  0.054825
2000-01-04 -0.689296 -0.064605  0.310550  0.471620
2000-01-05 -0.818026  0.207694  0.359911  0.346075
2000-01-06  0.812771 -0.337750  0.645985  0.119537
2000-01-07 -0.117398 -0.844191 -0.905368 -0.365953
2000-01-08  0.439313 -0.121758 -0.726344  0.969090

In [15]:
df[['A', 'B']]

                   A         B
2000-01-01  0.704924 -0.018492
2000-01-02 -0.114484  0.497136
2000-01-03 -0.708337 -0.116372
2000-01-04 -0.689296 -0.064605
2000-01-05 -0.818026  0.207694
2000-01-06  0.812771 -0.337750
2000-01-07 -0.117398 -0.844191
2000-01-08  0.439313 -0.121758

In [18]:
df.loc[:, ['B', 'A']]

                   B         A
2000-01-01 -0.018492  0.704924
2000-01-02  0.497136 -0.114484
2000-01-03 -0.116372 -0.708337
2000-01-04 -0.064605 -0.689296
2000-01-05  0.207694 -0.818026
2000-01-06 -0.337750  0.812771
2000-01-07 -0.844191 -0.117398
2000-01-08 -0.121758  0.439313

In [16]:
df.loc[:, ['B', 'A']] = df[['A', 'B']]

In [17]:
df[['A', 'B']]

                   A         B
2000-01-01  0.704924 -0.018492
2000-01-02 -0.114484  0.497136
2000-01-03 -0.708337 -0.116372
2000-01-04 -0.689296 -0.064605
2000-01-05 -0.818026  0.207694
2000-01-06  0.812771 -0.337750
2000-01-07 -0.117398 -0.844191
2000-01-08  0.439313 -0.121758

In [19]:
df.loc[:, ['B', 'A']] = df[['A', 'B']].to_numpy()

df[['A', 'B']]

                   A         B
2000-01-01 -0.018492  0.704924
2000-01-02  0.497136 -0.114484
2000-01-03 -0.116372 -0.708337
2000-01-04 -0.064605 -0.689296
2000-01-05  0.207694 -0.818026
2000-01-06 -0.337750  0.812771
2000-01-07 -0.844191 -0.117398
2000-01-08 -0.121758  0.439313